load-tests/load-test-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 4m10s max duration (incl. graceful stop):
              * ramp_load: Up to 100 looping VUs for 4m0s over 5 stages (gracefulRampDown: 10s, gracefulStop: 30s)


running (0m01.0s), 000/100 VUs, 0 complete and 0 interrupted iterations
ramp_load   [   0% ] 000/100 VUs  0m01.0s/4m00.0s

running (0m02.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
ramp_load   [   1% ] 001/100 VUs  0m02.0s/4m00.0s

running (0m03.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
ramp_load   [   1% ] 001/100 VUs  0m03.0s/4m00.0s

running (0m04.0s), 002/100 VUs, 1 complete and 0 interrupted iterations
ramp_load   [   2% ] 002/100 VUs  0m04.0s/4m00.0s

running (0m05.0s), 003/100 VUs, 3 complete and 0 interrupted iterations
ramp_load   [   2% ] 003/100 VUs  0m05.0s/4m00.0s

running (0m06.0s), 003/100 VUs, 4 complete and 0 interrupted iterations
ramp_load   [   2% ] 003/100 VUs  0m06.0s/4m00.0s

running (0m07.0s), 004/100 VUs, 6 complete and 0 interrupted iterations
ramp_load   [   3% ] 004/100 VUs  0m07.0s/4m00.0s

running (0m08.0s), 005/100 VUs, 9 complete and 0 interrupted iterations
ramp_load   [   3% ] 005/100 VUs  0m08.0s/4m00.0s

running (0m09.0s), 005/100 VUs, 11 complete and 0 interrupted iterations
ramp_load   [   4% ] 005/100 VUs  0m09.0s/4m00.0s

running (0m10.0s), 006/100 VUs, 15 complete and 0 interrupted iterations
ramp_load   [   4% ] 006/100 VUs  0m10.0s/4m00.0s

running (0m11.0s), 007/100 VUs, 19 complete and 0 interrupted iterations
ramp_load   [   5% ] 007/100 VUs  0m11.0s/4m00.0s

running (0m12.0s), 007/100 VUs, 22 complete and 0 interrupted iterations
ramp_load   [   5% ] 007/100 VUs  0m12.0s/4m00.0s

running (0m13.0s), 008/100 VUs, 28 complete and 0 interrupted iterations
ramp_load   [   5% ] 008/100 VUs  0m13.0s/4m00.0s

running (0m14.0s), 009/100 VUs, 32 complete and 0 interrupted iterations
ramp_load   [   6% ] 009/100 VUs  0m14.0s/4m00.0s

running (0m15.0s), 009/100 VUs, 38 complete and 0 interrupted iterations
ramp_load   [   6% ] 009/100 VUs  0m15.0s/4m00.0s

running (0m16.0s), 010/100 VUs, 42 complete and 0 interrupted iterations
ramp_load   [   7% ] 010/100 VUs  0m16.0s/4m00.0s

running (0m17.0s), 011/100 VUs, 51 complete and 0 interrupted iterations
ramp_load   [   7% ] 011/100 VUs  0m17.0s/4m00.0s

running (0m18.0s), 011/100 VUs, 54 complete and 0 interrupted iterations
ramp_load   [   7% ] 011/100 VUs  0m18.0s/4m00.0s

running (0m19.0s), 012/100 VUs, 62 complete and 0 interrupted iterations
ramp_load   [   8% ] 012/100 VUs  0m19.0s/4m00.0s

running (0m20.0s), 013/100 VUs, 71 complete and 0 interrupted iterations
ramp_load   [   8% ] 013/100 VUs  0m20.0s/4m00.0s

running (0m21.0s), 013/100 VUs, 76 complete and 0 interrupted iterations
ramp_load   [   9% ] 013/100 VUs  0m21.0s/4m00.0s

running (0m22.0s), 014/100 VUs, 87 complete and 0 interrupted iterations
ramp_load   [   9% ] 014/100 VUs  0m22.0s/4m00.0s

running (0m23.0s), 015/100 VUs, 95 complete and 0 interrupted iterations
ramp_load   [  10% ] 015/100 VUs  0m23.0s/4m00.0s

running (0m24.0s), 015/100 VUs, 105 complete and 0 interrupted iterations
ramp_load   [  10% ] 015/100 VUs  0m24.0s/4m00.0s

running (0m25.0s), 016/100 VUs, 113 complete and 0 interrupted iterations
ramp_load   [  10% ] 016/100 VUs  0m25.0s/4m00.0s

running (0m26.0s), 017/100 VUs, 124 complete and 0 interrupted iterations
ramp_load   [  11% ] 017/100 VUs  0m26.0s/4m00.0s

running (0m27.0s), 017/100 VUs, 133 complete and 0 interrupted iterations
ramp_load   [  11% ] 017/100 VUs  0m27.0s/4m00.0s

running (0m28.0s), 018/100 VUs, 147 complete and 0 interrupted iterations
ramp_load   [  12% ] 018/100 VUs  0m28.0s/4m00.0s

running (0m29.0s), 019/100 VUs, 155 complete and 0 interrupted iterations
ramp_load   [  12% ] 019/100 VUs  0m29.0s/4m00.0s

running (0m30.0s), 019/100 VUs, 166 complete and 0 interrupted iterations
ramp_load   [  12% ] 019/100 VUs  0m30.0s/4m00.0s

running (0m31.0s), 020/100 VUs, 179 complete and 0 interrupted iterations
ramp_load   [  13% ] 020/100 VUs  0m31.0s/4m00.0s

running (0m32.0s), 020/100 VUs, 191 complete and 0 interrupted iterations
ramp_load   [  13% ] 020/100 VUs  0m32.0s/4m00.0s

running (0m33.0s), 021/100 VUs, 203 complete and 0 interrupted iterations
ramp_load   [  14% ] 021/100 VUs  0m33.0s/4m00.0s

running (0m34.0s), 021/100 VUs, 218 complete and 0 interrupted iterations
ramp_load   [  14% ] 021/100 VUs  0m34.0s/4m00.0s

running (0m35.0s), 022/100 VUs, 229 complete and 0 interrupted iterations
ramp_load   [  15% ] 022/100 VUs  0m35.0s/4m00.0s

running (0m36.0s), 022/100 VUs, 245 complete and 0 interrupted iterations
ramp_load   [  15% ] 022/100 VUs  0m36.0s/4m00.0s

running (0m37.0s), 023/100 VUs, 257 complete and 0 interrupted iterations
ramp_load   [  15% ] 023/100 VUs  0m37.0s/4m00.0s

running (0m38.0s), 023/100 VUs, 274 complete and 0 interrupted iterations
ramp_load   [  16% ] 023/100 VUs  0m38.0s/4m00.0s

running (0m39.0s), 024/100 VUs, 285 complete and 0 interrupted iterations
ramp_load   [  16% ] 024/100 VUs  0m39.0s/4m00.0s

running (0m40.0s), 024/100 VUs, 304 complete and 0 interrupted iterations
ramp_load   [  17% ] 024/100 VUs  0m40.0s/4m00.0s

running (0m41.0s), 025/100 VUs, 316 complete and 0 interrupted iterations
ramp_load   [  17% ] 025/100 VUs  0m41.0s/4m00.0s

running (0m42.0s), 025/100 VUs, 330 complete and 0 interrupted iterations
ramp_load   [  17% ] 025/100 VUs  0m42.0s/4m00.0s

running (0m43.0s), 026/100 VUs, 347 complete and 0 interrupted iterations
ramp_load   [  18% ] 026/100 VUs  0m43.0s/4m00.0s

running (0m44.0s), 026/100 VUs, 362 complete and 0 interrupted iterations
ramp_load   [  18% ] 026/100 VUs  0m44.0s/4m00.0s

running (0m45.0s), 027/100 VUs, 380 complete and 0 interrupted iterations
ramp_load   [  19% ] 027/100 VUs  0m45.0s/4m00.0s

running (0m46.0s), 027/100 VUs, 398 complete and 0 interrupted iterations
ramp_load   [  19% ] 027/100 VUs  0m46.0s/4m00.0s

running (0m47.0s), 028/100 VUs, 412 complete and 0 interrupted iterations
ramp_load   [  20% ] 028/100 VUs  0m47.0s/4m00.0s

running (0m48.0s), 028/100 VUs, 431 complete and 0 interrupted iterations
ramp_load   [  20% ] 028/100 VUs  0m48.0s/4m00.0s

running (0m49.0s), 029/100 VUs, 448 complete and 0 interrupted iterations
ramp_load   [  20% ] 029/100 VUs  0m49.0s/4m00.0s

running (0m50.0s), 029/100 VUs, 462 complete and 0 interrupted iterations
ramp_load   [  21% ] 029/100 VUs  0m50.0s/4m00.0s

running (0m51.0s), 030/100 VUs, 483 complete and 0 interrupted iterations
ramp_load   [  21% ] 030/100 VUs  0m51.0s/4m00.0s

running (0m52.0s), 030/100 VUs, 501 complete and 0 interrupted iterations
ramp_load   [  22% ] 030/100 VUs  0m52.0s/4m00.0s

running (0m53.0s), 031/100 VUs, 519 complete and 0 interrupted iterations
ramp_load   [  22% ] 031/100 VUs  0m53.0s/4m00.0s

running (0m54.0s), 031/100 VUs, 540 complete and 0 interrupted iterations
ramp_load   [  22% ] 031/100 VUs  0m54.0s/4m00.0s

running (0m55.0s), 032/100 VUs, 556 complete and 0 interrupted iterations
ramp_load   [  23% ] 032/100 VUs  0m55.0s/4m00.0s

running (0m56.0s), 032/100 VUs, 579 complete and 0 interrupted iterations
ramp_load   [  23% ] 032/100 VUs  0m56.0s/4m00.0s

running (0m57.0s), 033/100 VUs, 597 complete and 0 interrupted iterations
ramp_load   [  24% ] 033/100 VUs  0m57.0s/4m00.0s

running (0m58.0s), 033/100 VUs, 617 complete and 0 interrupted iterations
ramp_load   [  24% ] 033/100 VUs  0m58.0s/4m00.0s

running (0m59.0s), 034/100 VUs, 637 complete and 0 interrupted iterations
ramp_load   [  25% ] 034/100 VUs  0m59.0s/4m00.0s

running (1m00.0s), 034/100 VUs, 659 complete and 0 interrupted iterations
ramp_load   [  25% ] 034/100 VUs  1m00.0s/4m00.0s

running (1m01.0s), 035/100 VUs, 683 complete and 0 interrupted iterations
ramp_load   [  25% ] 035/100 VUs  1m01.0s/4m00.0s

running (1m02.0s), 035/100 VUs, 702 complete and 0 interrupted iterations
ramp_load   [  26% ] 035/100 VUs  1m02.0s/4m00.0s

running (1m03.0s), 036/100 VUs, 723 complete and 0 interrupted iterations
ramp_load   [  26% ] 036/100 VUs  1m03.0s/4m00.0s

running (1m04.0s), 036/100 VUs, 745 complete and 0 interrupted iterations
ramp_load   [  27% ] 036/100 VUs  1m04.0s/4m00.0s

running (1m05.0s), 037/100 VUs, 772 complete and 0 interrupted iterations
ramp_load   [  27% ] 037/100 VUs  1m05.0s/4m00.0s

running (1m06.0s), 037/100 VUs, 789 complete and 0 interrupted iterations
ramp_load   [  27% ] 037/100 VUs  1m06.0s/4m00.0s

running (1m07.0s), 038/100 VUs, 818 complete and 0 interrupted iterations
ramp_load   [  28% ] 038/100 VUs  1m07.0s/4m00.0s

running (1m08.0s), 038/100 VUs, 838 complete and 0 interrupted iterations
ramp_load   [  28% ] 038/100 VUs  1m08.0s/4m00.0s

running (1m09.0s), 039/100 VUs, 860 complete and 0 interrupted iterations
ramp_load   [  29% ] 039/100 VUs  1m09.0s/4m00.0s

running (1m10.0s), 039/100 VUs, 887 complete and 0 interrupted iterations
ramp_load   [  29% ] 039/100 VUs  1m10.0s/4m00.0s

running (1m11.0s), 040/100 VUs, 910 complete and 0 interrupted iterations
ramp_load   [  30% ] 040/100 VUs  1m11.0s/4m00.0s

running (1m12.0s), 040/100 VUs, 935 complete and 0 interrupted iterations
ramp_load   [  30% ] 040/100 VUs  1m12.0s/4m00.0s

running (1m13.0s), 041/100 VUs, 957 complete and 0 interrupted iterations
ramp_load   [  30% ] 041/100 VUs  1m13.0s/4m00.0s

running (1m14.0s), 041/100 VUs, 987 complete and 0 interrupted iterations
ramp_load   [  31% ] 041/100 VUs  1m14.0s/4m00.0s

running (1m15.0s), 042/100 VUs, 1007 complete and 0 interrupted iterations
ramp_load   [  31% ] 042/100 VUs  1m15.0s/4m00.0s

running (1m16.0s), 042/100 VUs, 1035 complete and 0 interrupted iterations
ramp_load   [  32% ] 042/100 VUs  1m16.0s/4m00.0s

running (1m17.0s), 043/100 VUs, 1062 complete and 0 interrupted iterations
ramp_load   [  32% ] 043/100 VUs  1m17.0s/4m00.0s

running (1m18.0s), 043/100 VUs, 1090 complete and 0 interrupted iterations
ramp_load   [  32% ] 043/100 VUs  1m18.0s/4m00.0s

running (1m19.0s), 044/100 VUs, 1114 complete and 0 interrupted iterations
ramp_load   [  33% ] 044/100 VUs  1m19.0s/4m00.0s

running (1m20.0s), 044/100 VUs, 1141 complete and 0 interrupted iterations
ramp_load   [  33% ] 044/100 VUs  1m20.0s/4m00.0s

running (1m21.0s), 045/100 VUs, 1168 complete and 0 interrupted iterations
ramp_load   [  34% ] 045/100 VUs  1m21.0s/4m00.0s

running (1m22.0s), 045/100 VUs, 1200 complete and 0 interrupted iterations
ramp_load   [  34% ] 045/100 VUs  1m22.0s/4m00.0s

running (1m23.0s), 046/100 VUs, 1226 complete and 0 interrupted iterations
ramp_load   [  35% ] 046/100 VUs  1m23.0s/4m00.0s

running (1m24.0s), 046/100 VUs, 1254 complete and 0 interrupted iterations
ramp_load   [  35% ] 046/100 VUs  1m24.0s/4m00.0s

running (1m25.0s), 047/100 VUs, 1281 complete and 0 interrupted iterations
ramp_load   [  35% ] 047/100 VUs  1m25.0s/4m00.0s

running (1m26.0s), 047/100 VUs, 1314 complete and 0 interrupted iterations
ramp_load   [  36% ] 047/100 VUs  1m26.0s/4m00.0s

running (1m27.0s), 048/100 VUs, 1344 complete and 0 interrupted iterations
ramp_load   [  36% ] 048/100 VUs  1m27.0s/4m00.0s

running (1m28.0s), 048/100 VUs, 1367 complete and 0 interrupted iterations
ramp_load   [  37% ] 048/100 VUs  1m28.0s/4m00.0s

running (1m29.0s), 049/100 VUs, 1397 complete and 0 interrupted iterations
ramp_load   [  37% ] 049/100 VUs  1m29.0s/4m00.0s

running (1m30.0s), 049/100 VUs, 1431 complete and 0 interrupted iterations
ramp_load   [  37% ] 049/100 VUs  1m30.0s/4m00.0s

running (1m31.0s), 050/100 VUs, 1460 complete and 0 interrupted iterations
ramp_load   [  38% ] 050/100 VUs  1m31.0s/4m00.0s

running (1m32.0s), 051/100 VUs, 1495 complete and 0 interrupted iterations
ramp_load   [  38% ] 051/100 VUs  1m32.0s/4m00.0s

running (1m33.0s), 052/100 VUs, 1523 complete and 0 interrupted iterations
ramp_load   [  39% ] 052/100 VUs  1m33.0s/4m00.0s

running (1m34.0s), 053/100 VUs, 1551 complete and 0 interrupted iterations
ramp_load   [  39% ] 053/100 VUs  1m34.0s/4m00.0s

running (1m35.0s), 054/100 VUs, 1585 complete and 0 interrupted iterations
ramp_load   [  40% ] 054/100 VUs  1m35.0s/4m00.0s

running (1m36.0s), 054/100 VUs, 1615 complete and 0 interrupted iterations
ramp_load   [  40% ] 054/100 VUs  1m36.0s/4m00.0s

running (1m37.0s), 055/100 VUs, 1655 complete and 0 interrupted iterations
ramp_load   [  40% ] 055/100 VUs  1m37.0s/4m00.0s

running (1m38.0s), 056/100 VUs, 1689 complete and 0 interrupted iterations
ramp_load   [  41% ] 056/100 VUs  1m38.0s/4m00.0s

running (1m39.0s), 057/100 VUs, 1721 complete and 0 interrupted iterations
ramp_load   [  41% ] 057/100 VUs  1m39.0s/4m00.0s

running (1m40.0s), 058/100 VUs, 1756 complete and 0 interrupted iterations
ramp_load   [  42% ] 058/100 VUs  1m40.0s/4m00.0s

running (1m41.0s), 059/100 VUs, 1792 complete and 0 interrupted iterations
ramp_load   [  42% ] 059/100 VUs  1m41.0s/4m00.0s

running (1m42.0s), 059/100 VUs, 1830 complete and 0 interrupted iterations
ramp_load   [  42% ] 059/100 VUs  1m42.0s/4m00.0s

running (1m43.0s), 060/100 VUs, 1861 complete and 0 interrupted iterations
ramp_load   [  43% ] 060/100 VUs  1m43.0s/4m00.0s

running (1m44.0s), 061/100 VUs, 1898 complete and 0 interrupted iterations
ramp_load   [  43% ] 061/100 VUs  1m44.0s/4m00.0s

running (1m45.0s), 062/100 VUs, 1939 complete and 0 interrupted iterations
ramp_load   [  44% ] 062/100 VUs  1m45.0s/4m00.0s

running (1m46.0s), 063/100 VUs, 1977 complete and 0 interrupted iterations
ramp_load   [  44% ] 063/100 VUs  1m46.0s/4m00.0s

running (1m47.0s), 064/100 VUs, 2014 complete and 0 interrupted iterations
ramp_load   [  45% ] 064/100 VUs  1m47.0s/4m00.0s

running (1m48.0s), 064/100 VUs, 2056 complete and 0 interrupted iterations
ramp_load   [  45% ] 064/100 VUs  1m48.0s/4m00.0s

running (1m49.0s), 065/100 VUs, 2095 complete and 0 interrupted iterations
ramp_load   [  45% ] 065/100 VUs  1m49.0s/4m00.0s

running (1m50.0s), 066/100 VUs, 2130 complete and 0 interrupted iterations
ramp_load   [  46% ] 066/100 VUs  1m50.0s/4m00.0s

running (1m51.0s), 067/100 VUs, 2175 complete and 0 interrupted iterations
ramp_load   [  46% ] 067/100 VUs  1m51.0s/4m00.0s

running (1m52.0s), 068/100 VUs, 2211 complete and 0 interrupted iterations
ramp_load   [  47% ] 068/100 VUs  1m52.0s/4m00.0s

running (1m53.0s), 069/100 VUs, 2253 complete and 0 interrupted iterations
ramp_load   [  47% ] 069/100 VUs  1m53.0s/4m00.0s

running (1m54.0s), 069/100 VUs, 2298 complete and 0 interrupted iterations
ramp_load   [  47% ] 069/100 VUs  1m54.0s/4m00.0s

running (1m55.0s), 070/100 VUs, 2332 complete and 0 interrupted iterations
ramp_load   [  48% ] 070/100 VUs  1m55.0s/4m00.0s

running (1m56.0s), 071/100 VUs, 2382 complete and 0 interrupted iterations
ramp_load   [  48% ] 071/100 VUs  1m56.0s/4m00.0s

running (1m57.0s), 072/100 VUs, 2429 complete and 0 interrupted iterations
ramp_load   [  49% ] 072/100 VUs  1m57.0s/4m00.0s

running (1m58.0s), 073/100 VUs, 2462 complete and 0 interrupted iterations
ramp_load   [  49% ] 073/100 VUs  1m58.0s/4m00.0s

running (1m59.0s), 074/100 VUs, 2515 complete and 0 interrupted iterations
ramp_load   [  50% ] 074/100 VUs  1m59.0s/4m00.0s

running (2m00.0s), 074/100 VUs, 2559 complete and 0 interrupted iterations
ramp_load   [  50% ] 074/100 VUs  2m00.0s/4m00.0s

running (2m01.0s), 075/100 VUs, 2603 complete and 0 interrupted iterations
ramp_load   [  50% ] 075/100 VUs  2m01.0s/4m00.0s

running (2m02.0s), 076/100 VUs, 2652 complete and 0 interrupted iterations
ramp_load   [  51% ] 076/100 VUs  2m02.0s/4m00.0s

running (2m03.0s), 077/100 VUs, 2699 complete and 0 interrupted iterations
ramp_load   [  51% ] 077/100 VUs  2m03.0s/4m00.0s

running (2m04.0s), 078/100 VUs, 2747 complete and 0 interrupted iterations
ramp_load   [  52% ] 078/100 VUs  2m04.0s/4m00.0s

running (2m05.0s), 079/100 VUs, 2797 complete and 0 interrupted iterations
ramp_load   [  52% ] 079/100 VUs  2m05.0s/4m00.0s

running (2m06.0s), 079/100 VUs, 2843 complete and 0 interrupted iterations
ramp_load   [  52% ] 079/100 VUs  2m06.0s/4m00.0s

running (2m07.0s), 080/100 VUs, 2885 complete and 0 interrupted iterations
ramp_load   [  53% ] 080/100 VUs  2m07.0s/4m00.0s

running (2m08.0s), 081/100 VUs, 2941 complete and 0 interrupted iterations
ramp_load   [  53% ] 081/100 VUs  2m08.0s/4m00.0s

running (2m09.0s), 082/100 VUs, 2993 complete and 0 interrupted iterations
ramp_load   [  54% ] 082/100 VUs  2m09.0s/4m00.0s

running (2m10.0s), 083/100 VUs, 3034 complete and 0 interrupted iterations
ramp_load   [  54% ] 083/100 VUs  2m10.0s/4m00.0s

running (2m11.0s), 084/100 VUs, 3090 complete and 0 interrupted iterations
ramp_load   [  55% ] 084/100 VUs  2m11.0s/4m00.0s

running (2m12.0s), 084/100 VUs, 3150 complete and 0 interrupted iterations
ramp_load   [  55% ] 084/100 VUs  2m12.0s/4m00.0s

running (2m13.0s), 085/100 VUs, 3196 complete and 0 interrupted iterations
ramp_load   [  55% ] 085/100 VUs  2m13.0s/4m00.0s

running (2m14.0s), 086/100 VUs, 3249 complete and 0 interrupted iterations
ramp_load   [  56% ] 086/100 VUs  2m14.0s/4m00.0s

running (2m15.0s), 087/100 VUs, 3305 complete and 0 interrupted iterations
ramp_load   [  56% ] 087/100 VUs  2m15.0s/4m00.0s

running (2m16.0s), 088/100 VUs, 3352 complete and 0 interrupted iterations
ramp_load   [  57% ] 088/100 VUs  2m16.0s/4m00.0s

running (2m17.0s), 089/100 VUs, 3411 complete and 0 interrupted iterations
ramp_load   [  57% ] 089/100 VUs  2m17.0s/4m00.0s

running (2m18.0s), 089/100 VUs, 3458 complete and 0 interrupted iterations
ramp_load   [  57% ] 089/100 VUs  2m18.0s/4m00.0s

running (2m19.0s), 090/100 VUs, 3516 complete and 0 interrupted iterations
ramp_load   [  58% ] 090/100 VUs  2m19.0s/4m00.0s

running (2m20.0s), 091/100 VUs, 3578 complete and 0 interrupted iterations
ramp_load   [  58% ] 091/100 VUs  2m20.0s/4m00.0s

running (2m21.0s), 092/100 VUs, 3630 complete and 0 interrupted iterations
ramp_load   [  59% ] 092/100 VUs  2m21.0s/4m00.0s

running (2m22.0s), 093/100 VUs, 3686 complete and 0 interrupted iterations
ramp_load   [  59% ] 093/100 VUs  2m22.0s/4m00.0s

running (2m23.0s), 094/100 VUs, 3745 complete and 0 interrupted iterations
ramp_load   [  60% ] 094/100 VUs  2m23.0s/4m00.0s

running (2m24.0s), 094/100 VUs, 3807 complete and 0 interrupted iterations
ramp_load   [  60% ] 094/100 VUs  2m24.0s/4m00.0s

running (2m25.0s), 095/100 VUs, 3865 complete and 0 interrupted iterations
ramp_load   [  60% ] 095/100 VUs  2m25.0s/4m00.0s

running (2m26.0s), 096/100 VUs, 3917 complete and 0 interrupted iterations
ramp_load   [  61% ] 096/100 VUs  2m26.0s/4m00.0s

running (2m27.0s), 097/100 VUs, 3977 complete and 0 interrupted iterations
ramp_load   [  61% ] 097/100 VUs  2m27.0s/4m00.0s

running (2m28.0s), 098/100 VUs, 4041 complete and 0 interrupted iterations
ramp_load   [  62% ] 098/100 VUs  2m28.0s/4m00.0s

running (2m29.0s), 099/100 VUs, 4097 complete and 0 interrupted iterations
ramp_load   [  62% ] 099/100 VUs  2m29.0s/4m00.0s

running (2m30.0s), 099/100 VUs, 4166 complete and 0 interrupted iterations
ramp_load   [  62% ] 099/100 VUs  2m30.0s/4m00.0s

running (2m31.0s), 100/100 VUs, 4220 complete and 0 interrupted iterations
ramp_load   [  63% ] 100/100 VUs  2m31.0s/4m00.0s

running (2m32.0s), 100/100 VUs, 4289 complete and 0 interrupted iterations
ramp_load   [  63% ] 100/100 VUs  2m32.0s/4m00.0s

running (2m33.0s), 100/100 VUs, 4348 complete and 0 interrupted iterations
ramp_load   [  64% ] 100/100 VUs  2m33.0s/4m00.0s

running (2m34.0s), 100/100 VUs, 4404 complete and 0 interrupted iterations
ramp_load   [  64% ] 100/100 VUs  2m34.0s/4m00.0s

running (2m35.0s), 100/100 VUs, 4475 complete and 0 interrupted iterations
ramp_load   [  65% ] 100/100 VUs  2m35.0s/4m00.0s

running (2m36.0s), 100/100 VUs, 4534 complete and 0 interrupted iterations
ramp_load   [  65% ] 100/100 VUs  2m36.0s/4m00.0s

running (2m37.0s), 100/100 VUs, 4596 complete and 0 interrupted iterations
ramp_load   [  65% ] 100/100 VUs  2m37.0s/4m00.0s

running (2m38.0s), 100/100 VUs, 4665 complete and 0 interrupted iterations
ramp_load   [  66% ] 100/100 VUs  2m38.0s/4m00.0s

running (2m39.0s), 100/100 VUs, 4716 complete and 0 interrupted iterations
ramp_load   [  66% ] 100/100 VUs  2m39.0s/4m00.0s

running (2m40.0s), 100/100 VUs, 4790 complete and 0 interrupted iterations
ramp_load   [  67% ] 100/100 VUs  2m40.0s/4m00.0s

running (2m41.0s), 100/100 VUs, 4850 complete and 0 interrupted iterations
ramp_load   [  67% ] 100/100 VUs  2m41.0s/4m00.0s

running (2m42.0s), 100/100 VUs, 4910 complete and 0 interrupted iterations
ramp_load   [  67% ] 100/100 VUs  2m42.0s/4m00.0s

running (2m43.0s), 100/100 VUs, 4969 complete and 0 interrupted iterations
ramp_load   [  68% ] 100/100 VUs  2m43.0s/4m00.0s

running (2m44.0s), 100/100 VUs, 5035 complete and 0 interrupted iterations
ramp_load   [  68% ] 100/100 VUs  2m44.0s/4m00.0s

running (2m45.0s), 100/100 VUs, 5094 complete and 0 interrupted iterations
ramp_load   [  69% ] 100/100 VUs  2m45.0s/4m00.0s

running (2m46.0s), 100/100 VUs, 5156 complete and 0 interrupted iterations
ramp_load   [  69% ] 100/100 VUs  2m46.0s/4m00.0s

running (2m47.0s), 100/100 VUs, 5220 complete and 0 interrupted iterations
ramp_load   [  70% ] 100/100 VUs  2m47.0s/4m00.0s

running (2m48.0s), 100/100 VUs, 5281 complete and 0 interrupted iterations
ramp_load   [  70% ] 100/100 VUs  2m48.0s/4m00.0s

running (2m49.0s), 100/100 VUs, 5342 complete and 0 interrupted iterations
ramp_load   [  70% ] 100/100 VUs  2m49.0s/4m00.0s

running (2m50.0s), 100/100 VUs, 5408 complete and 0 interrupted iterations
ramp_load   [  71% ] 100/100 VUs  2m50.0s/4m00.0s

running (2m51.0s), 100/100 VUs, 5470 complete and 0 interrupted iterations
ramp_load   [  71% ] 100/100 VUs  2m51.0s/4m00.0s

running (2m52.0s), 100/100 VUs, 5536 complete and 0 interrupted iterations
ramp_load   [  72% ] 100/100 VUs  2m52.0s/4m00.0s

running (2m53.0s), 100/100 VUs, 5590 complete and 0 interrupted iterations
ramp_load   [  72% ] 100/100 VUs  2m53.0s/4m00.0s

running (2m54.0s), 100/100 VUs, 5660 complete and 0 interrupted iterations
ramp_load   [  72% ] 100/100 VUs  2m54.0s/4m00.0s

running (2m55.0s), 100/100 VUs, 5714 complete and 0 interrupted iterations
ramp_load   [  73% ] 100/100 VUs  2m55.0s/4m00.0s

running (2m56.0s), 100/100 VUs, 5779 complete and 0 interrupted iterations
ramp_load   [  73% ] 100/100 VUs  2m56.0s/4m00.0s

running (2m57.0s), 100/100 VUs, 5842 complete and 0 interrupted iterations
ramp_load   [  74% ] 100/100 VUs  2m57.0s/4m00.0s

running (2m58.0s), 100/100 VUs, 5899 complete and 0 interrupted iterations
ramp_load   [  74% ] 100/100 VUs  2m58.0s/4m00.0s

running (2m59.0s), 100/100 VUs, 5964 complete and 0 interrupted iterations
ramp_load   [  75% ] 100/100 VUs  2m59.0s/4m00.0s

running (3m00.0s), 100/100 VUs, 6033 complete and 0 interrupted iterations
ramp_load   [  75% ] 100/100 VUs  3m00.0s/4m00.0s

running (3m01.0s), 100/100 VUs, 6088 complete and 0 interrupted iterations
ramp_load   [  75% ] 100/100 VUs  3m01.0s/4m00.0s

running (3m02.0s), 100/100 VUs, 6150 complete and 0 interrupted iterations
ramp_load   [  76% ] 100/100 VUs  3m02.0s/4m00.0s

running (3m03.0s), 100/100 VUs, 6210 complete and 0 interrupted iterations
ramp_load   [  76% ] 100/100 VUs  3m03.0s/4m00.0s

running (3m04.0s), 100/100 VUs, 6274 complete and 0 interrupted iterations
ramp_load   [  77% ] 100/100 VUs  3m04.0s/4m00.0s

running (3m05.0s), 100/100 VUs, 6334 complete and 0 interrupted iterations
ramp_load   [  77% ] 100/100 VUs  3m05.0s/4m00.0s

running (3m06.0s), 100/100 VUs, 6397 complete and 0 interrupted iterations
ramp_load   [  77% ] 100/100 VUs  3m06.0s/4m00.0s

running (3m07.0s), 100/100 VUs, 6457 complete and 0 interrupted iterations
ramp_load   [  78% ] 100/100 VUs  3m07.0s/4m00.0s

running (3m08.0s), 100/100 VUs, 6516 complete and 0 interrupted iterations
ramp_load   [  78% ] 100/100 VUs  3m08.0s/4m00.0s

running (3m09.0s), 100/100 VUs, 6583 complete and 0 interrupted iterations
ramp_load   [  79% ] 100/100 VUs  3m09.0s/4m00.0s

running (3m10.0s), 100/100 VUs, 6636 complete and 0 interrupted iterations
ramp_load   [  79% ] 100/100 VUs  3m10.0s/4m00.0s

running (3m11.0s), 100/100 VUs, 6702 complete and 0 interrupted iterations
ramp_load   [  80% ] 100/100 VUs  3m11.0s/4m00.0s

running (3m12.0s), 100/100 VUs, 6762 complete and 0 interrupted iterations
ramp_load   [  80% ] 100/100 VUs  3m12.0s/4m00.0s

running (3m13.0s), 100/100 VUs, 6827 complete and 0 interrupted iterations
ramp_load   [  80% ] 100/100 VUs  3m13.0s/4m00.0s

running (3m14.0s), 100/100 VUs, 6889 complete and 0 interrupted iterations
ramp_load   [  81% ] 100/100 VUs  3m14.0s/4m00.0s

running (3m15.0s), 100/100 VUs, 6950 complete and 0 interrupted iterations
ramp_load   [  81% ] 100/100 VUs  3m15.0s/4m00.0s

running (3m16.0s), 100/100 VUs, 7014 complete and 0 interrupted iterations
ramp_load   [  82% ] 100/100 VUs  3m16.0s/4m00.0s

running (3m17.0s), 100/100 VUs, 7073 complete and 0 interrupted iterations
ramp_load   [  82% ] 100/100 VUs  3m17.0s/4m00.0s

running (3m18.0s), 100/100 VUs, 7140 complete and 0 interrupted iterations
ramp_load   [  82% ] 100/100 VUs  3m18.0s/4m00.0s

running (3m19.0s), 100/100 VUs, 7200 complete and 0 interrupted iterations
ramp_load   [  83% ] 100/100 VUs  3m19.0s/4m00.0s

running (3m20.0s), 100/100 VUs, 7262 complete and 0 interrupted iterations
ramp_load   [  83% ] 100/100 VUs  3m20.0s/4m00.0s

running (3m21.0s), 100/100 VUs, 7326 complete and 0 interrupted iterations
ramp_load   [  84% ] 100/100 VUs  3m21.0s/4m00.0s

running (3m22.0s), 100/100 VUs, 7385 complete and 0 interrupted iterations
ramp_load   [  84% ] 100/100 VUs  3m22.0s/4m00.0s

running (3m23.0s), 100/100 VUs, 7452 complete and 0 interrupted iterations
ramp_load   [  85% ] 100/100 VUs  3m23.0s/4m00.0s

running (3m24.0s), 100/100 VUs, 7509 complete and 0 interrupted iterations
ramp_load   [  85% ] 100/100 VUs  3m24.0s/4m00.0s

running (3m25.0s), 100/100 VUs, 7566 complete and 0 interrupted iterations
ramp_load   [  85% ] 100/100 VUs  3m25.0s/4m00.0s

running (3m26.0s), 100/100 VUs, 7636 complete and 0 interrupted iterations
ramp_load   [  86% ] 100/100 VUs  3m26.0s/4m00.0s

running (3m27.0s), 100/100 VUs, 7699 complete and 0 interrupted iterations
ramp_load   [  86% ] 100/100 VUs  3m27.0s/4m00.0s

running (3m28.0s), 100/100 VUs, 7756 complete and 0 interrupted iterations
ramp_load   [  87% ] 100/100 VUs  3m28.0s/4m00.0s

running (3m29.0s), 100/100 VUs, 7823 complete and 0 interrupted iterations
ramp_load   [  87% ] 100/100 VUs  3m29.0s/4m00.0s

running (3m30.0s), 100/100 VUs, 7888 complete and 0 interrupted iterations
ramp_load   [  87% ] 100/100 VUs  3m30.0s/4m00.0s

running (3m31.0s), 099/100 VUs, 7945 complete and 0 interrupted iterations
ramp_load   [  88% ] 099/100 VUs  3m31.0s/4m00.0s

running (3m32.0s), 097/100 VUs, 8006 complete and 0 interrupted iterations
ramp_load   [  88% ] 097/100 VUs  3m32.0s/4m00.0s

running (3m33.0s), 093/100 VUs, 8074 complete and 0 interrupted iterations
ramp_load   [  89% ] 093/100 VUs  3m33.0s/4m00.0s

running (3m34.0s), 090/100 VUs, 8125 complete and 0 interrupted iterations
ramp_load   [  89% ] 090/100 VUs  3m34.0s/4m00.0s

running (3m35.0s), 085/100 VUs, 8179 complete and 0 interrupted iterations
ramp_load   [  90% ] 085/100 VUs  3m35.0s/4m00.0s

running (3m36.0s), 085/100 VUs, 8232 complete and 0 interrupted iterations
ramp_load   [  90% ] 085/100 VUs  3m36.0s/4m00.0s

running (3m37.0s), 081/100 VUs, 8291 complete and 0 interrupted iterations
ramp_load   [  90% ] 081/100 VUs  3m37.0s/4m00.0s

running (3m38.0s), 078/100 VUs, 8338 complete and 0 interrupted iterations
ramp_load   [  91% ] 078/100 VUs  3m38.0s/4m00.0s

running (3m39.0s), 073/100 VUs, 8388 complete and 0 interrupted iterations
ramp_load   [  91% ] 073/100 VUs  3m39.0s/4m00.0s

running (3m40.0s), 069/100 VUs, 8432 complete and 0 interrupted iterations
ramp_load   [  92% ] 069/100 VUs  3m40.0s/4m00.0s

running (3m41.0s), 068/100 VUs, 8478 complete and 0 interrupted iterations
ramp_load   [  92% ] 068/100 VUs  3m41.0s/4m00.0s

running (3m42.0s), 064/100 VUs, 8520 complete and 0 interrupted iterations
ramp_load   [  92% ] 064/100 VUs  3m42.0s/4m00.0s

running (3m43.0s), 062/100 VUs, 8559 complete and 0 interrupted iterations
ramp_load   [  93% ] 062/100 VUs  3m43.0s/4m00.0s

running (3m44.0s), 059/100 VUs, 8598 complete and 0 interrupted iterations
ramp_load   [  93% ] 059/100 VUs  3m44.0s/4m00.0s

running (3m45.0s), 054/100 VUs, 8632 complete and 0 interrupted iterations
ramp_load   [  94% ] 054/100 VUs  3m45.0s/4m00.0s

running (3m46.0s), 051/100 VUs, 8667 complete and 0 interrupted iterations
ramp_load   [  94% ] 051/100 VUs  3m46.0s/4m00.0s

running (3m47.0s), 049/100 VUs, 8696 complete and 0 interrupted iterations
ramp_load   [  95% ] 049/100 VUs  3m47.0s/4m00.0s

running (3m48.0s), 043/100 VUs, 8730 complete and 0 interrupted iterations
ramp_load   [  95% ] 043/100 VUs  3m48.0s/4m00.0s

running (3m49.0s), 038/100 VUs, 8756 complete and 0 interrupted iterations
ramp_load   [  95% ] 038/100 VUs  3m49.0s/4m00.0s

running (3m50.0s), 037/100 VUs, 8781 complete and 0 interrupted iterations
ramp_load   [  96% ] 037/100 VUs  3m50.0s/4m00.0s

running (3m51.0s), 032/100 VUs, 8806 complete and 0 interrupted iterations
ramp_load   [  96% ] 032/100 VUs  3m51.0s/4m00.0s

running (3m52.0s), 030/100 VUs, 8821 complete and 0 interrupted iterations
ramp_load   [  97% ] 030/100 VUs  3m52.0s/4m00.0s

running (3m53.0s), 027/100 VUs, 8841 complete and 0 interrupted iterations
ramp_load   [  97% ] 027/100 VUs  3m53.0s/4m00.0s

running (3m54.0s), 024/100 VUs, 8858 complete and 0 interrupted iterations
ramp_load   [  97% ] 024/100 VUs  3m54.0s/4m00.0s

running (3m55.0s), 020/100 VUs, 8877 complete and 0 interrupted iterations
ramp_load   [  98% ] 020/100 VUs  3m55.0s/4m00.0s

running (3m56.0s), 016/100 VUs, 8889 complete and 0 interrupted iterations
ramp_load   [  98% ] 016/100 VUs  3m56.0s/4m00.0s

running (3m57.0s), 013/100 VUs, 8899 complete and 0 interrupted iterations
ramp_load   [  99% ] 013/100 VUs  3m57.0s/4m00.0s

running (3m58.0s), 010/100 VUs, 8908 complete and 0 interrupted iterations
ramp_load   [  99% ] 010/100 VUs  3m58.0s/4m00.0s

running (3m59.0s), 005/100 VUs, 8914 complete and 0 interrupted iterations
ramp_load   [ 100% ] 005/100 VUs  3m59.0s/4m00.0s

running (4m00.0s), 002/100 VUs, 8918 complete and 0 interrupted iterations
ramp_load   [ 100% ] 002/100 VUs  4m00.0s/4m00.0s


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=9.11ms
    ✓ 'p(99)<1000' p(99)=13.73ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    lat_basket_add
    ✓ 'p(95)<400' p(95)=12.12915

    lat_pdp
    ✓ 'p(95)<300' p(95)=6.7311

    lat_plp
    ✓ 'p(95)<300' p(95)=5.35405


  █ TOTAL RESULTS 

    checks_total.......: 53520   222.286421/s
    checks_succeeded...: 100.00% 53520 out of 53520
    checks_failed......: 0.00%   0 out of 53520

    ✓ createUserId: status 200
    ✓ createUserId: valid UUID
    ✓ plp: status 200
    ✓ pdp: status 200
    ✓ basket_add: status 200
    ✓ basket_get: status 200

    CUSTOM
    errors.........................: 0.00%  0 out of 44600
    flows_completed................: 8920   37.047737/s
    lat_basket_add.................: avg=5.476995 min=1.143    med=4.5955 max=29.299  p(90)=9.7782 p(95)=12.12915
    lat_basket_get.................: avg=4.616192 min=0.805    med=4.138  max=29.115  p(90)=7.902  p(95)=9.9884  
    lat_create_user................: avg=3.018191 min=0.792    med=2.3675 max=22.86   p(90)=5.6891 p(95)=7.70715 
    lat_pdp........................: avg=1.654858 min=0.323    med=0.673  max=27.819  p(90)=4.5562 p(95)=6.7311  
    lat_plp........................: avg=1.428967 min=0.383    med=0.706  max=22.767  p(90)=3.4631 p(95)=5.35405 

    HTTP
    http_req_duration..............: avg=3.23ms   min=323µs    med=2.46ms max=29.29ms p(90)=6.91ms p(95)=9.11ms  
      { expected_response:true }...: avg=3.23ms   min=323µs    med=2.46ms max=29.29ms p(90)=6.91ms p(95)=9.11ms  
    http_req_failed................: 0.00%  0 out of 44600
    http_reqs......................: 44600  185.238684/s

    EXECUTION
    iteration_duration.............: avg=1.61s    min=810.58ms med=1.61s  max=2.43s   p(90)=2.01s  p(95)=2.04s   
    iterations.....................: 8920   37.047737/s
    vus............................: 2      min=0          max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 56 MB  233 kB/s
    data_sent......................: 6.9 MB 29 kB/s



running (4m00.8s), 000/100 VUs, 8920 complete and 0 interrupted iterations
ramp_load ✓ [ 100% ] 000/100 VUs  4m0s